import sys

column = ["A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z"]
row = ["1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20"]
theater = ["國賓大戲院","國賓影城@中和環球購物中心","國賓影城@台北長春廣場","國賓影城@台北微風廣場","國賓影城@林口昕境廣場","國賓影城@淡水禮萊廣場","國賓影城@新莊晶冠廣場","國賓影城@八德廣豐新天地","國賓影城@台南國賓廣場","國賓影城@高雄大魯閣草衙道","國賓影城@高雄義大世界","國賓影城@金門昇恆昌金湖廣場"]

print("theater,column,row,booked")
for T in theater:
    for C in column:
        for R in row:
            print(f"{T},{C},{R},0")

